Revit 2027 API
NumberingSchemaTypes Class
Provides a container of all Revit built-in NumberingSchemaType instances.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.NumberingSchemaTypes
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static class NumberingSchemaTypes
Public NotInheritable Class NumberingSchemaTypes
public ref class NumberingSchemaTypes abstract sealed
[<AbstractClassAttribute>]
[<SealedAttribute>]
type NumberingSchemaTypes = class end
See Also
Reference
Autodesk.Revit.DB Namespace